# CanSplit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..CanSplit Property
FamilyInstance Class See Also
---
Identifies whether a particular family instance can be split at a point on it's defining curve (by Split(Double)).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool CanSplit { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CanSplit As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CanSplit {
	bool get ();
}
```

# ### Field Value
True if the family instance can be split, otherwise false.
# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace